Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDisplayedEndStation(Autodesk.Revit.DB.Element,System.Double)
An internal setter for the alignment's "Displayed End Station" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDisplayedStartStation(Autodesk.Revit.DB.Element,System.Double)
An internal setter for the alignment's "Displayed Start Station" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDescription(Autodesk.Revit.DB.Element,System.String)
An internal setter for the alignment's "Description" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetName(Autodesk.Revit.DB.Element,System.String)
An internal setter for the alignment's "Name" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.AttachCell(Autodesk.Revit.DB.Element)
An internal creation method to create and attach cell to the specified DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Infrastructure.AlignmentCell
A cell to customize the behavior of elements of category OST_Alignments.
Since:
2021